Repository: gkapelakos/PennyPilot
Catalog: lib/src/l10n/app_*.arb
Languages: el

source: DEMO
el: ΔΟΚΙΜΗ

source: Scan Emails
el: Σάρωση E-mail

# errorScanning
source: Error scanning: {error}
el: Σφάλμα σάρωσης: {error}

source: Spending by Category
el: Δαπάνες ανά κατηγορία

source: Spending Pulse
el: Παλμός δαπανών

source: Recent Transactions
el: Πρόσφατες Συναλλαγές

source: View All
el: Προβολή όλων

# errorLoadingTransactions
source: Error loading transactions: {error}
el: Σφάλμα φόρτωσης συναλλαγών: {error}

source: Upcoming Subscriptions
el: Επόμενες Συνδρομές

# noActiveSubscriptions
source: No active subscriptions detected.
el: Δεν εντοπίστηκαν ενεργές συνδρομές.

# renewingInDays
source: Renewing in {days} days
el: Ανανέωση σε {days} ημέρες

# errorLoadingSubscriptions
source: Error loading subscriptions: {error}
el: Σφάλμα φόρτωσης συνδρομών: {error}

source: No Transactions Yet
el: Καμία συναλλαγή ακόμα

# connectEmailDescription
source: Connect your email to automatically scan for receipts and track your spending.
el: Συνδέστε το email σας για αυτόματη σάρωση αποδείξεων και παρακολούθηση των δαπανών σας.

source: Connect Email
el: Σύνδεση Email

source: Overview
el: Επισκόπηση

source: Transactions
el: Συναλλαγές

source: Subs
el: Συνδρομές

source: Insights
el: Αναλύσεις

source: Settings
el: Ρυθμίσεις

source: Appearance
el: Εμφάνιση

source: Light
el: Φωτεινό

source: Dark
el: Σκοτεινό

source: System
el: Σύστημα

source: Pitch Black OLED
el: Απόλυτο Μαύρο (OLED)

# oledDescription
source: Completely black background for OLED screens
el: Πλήρως μαύρο φόντο για οθόνες OLED

source: Accounts
el: Λογαριασμοί

source: Manage connected accounts
el: Διαχείριση συνδεδεμένων λογαριασμών

source: No accounts connected
el: Κανένας συνδεδεμένος λογαριασμός

# accountsConnected
source: {count, plural, =1{1 account connected} other{{count} accounts connected}}
el: {count, plural, =1{1 λογαριασμός συνδεδεμένος} other{{count} λογαριασμοί συνδεδεμένοι}}

source: Language
el: Γλώσσα

source: Select Language
el: Επιλογή Γλώσσας

source: General
el: Γενικά

source: Primary Currency
el: Κύριο Νόμισμα

source: Manage Categories
el: Διαχείριση Κατηγοριών

source: Privacy & Security
el: Απόρρητο & Ασφάλεια

source: Privacy Audit
el: Έλεγχος Απορρήτου

source: Rescan Emails
el: Επανασάρωση Email

source: Scanning emails...
el: Σάρωση email...

source: Scan complete
el: Η σάρωση ολοκληρώθηκε

# scanFailed
source: Scan failed: {error}
el: Η σάρωση απέτυχε: {error}

source: Backups
el: Αντίγραφα ασφαλείας

source: About PennyPilot
el: Σχετικά με το PennyPilot

source: Select Currency
el: Επιλογή Νομίσματος

# searchHint
source: Search merchant or notes...
el: Αναζήτηση εμπόρου ή σημειώσεων...

source: Close Search
el: Κλείσιμο Αναζήτησης

source: Search
el: Αναζήτηση

source: Scan Receipt
el: Σάρωση Απόδειξης

# filterAndSort
source: Filter & Sort
el: Φιλτράρισμα & Ταξινόμηση

source: No Matches
el: Δεν βρέθηκαν αποτελέσματα

# tryAdjustingFilters
source: Try adjusting your filters
el: Δοκιμάστε να προσαρμόσετε τα φίλτρα σας

source: Clear Filters
el: Καθαρισμός Φίλτρων

source: Loading transactions...
el: Φόρτωση συναλλαγών...

source: Failed to Load
el: Αποτυχία Φόρτωσης

source: Add Entry
el: Προσθήκη Εγγραφής

source: Income
el: Έσοδα

source: Expenses
el: Έξοδα

source: Net
el: Καθαρά

# categoryFilter
source: Category: {category}
el: Κατηγορία: {category}

# sortFilter
source: Sort: {sort}
el: Ταξινόμηση: {sort}

source: Date
el: Ημερομηνία

source: Amount
el: Ποσό

source: Merchant
el: Έμπορος

source: Reset
el: Επαναφορά

source: Apply
el: Εφαρμογή

source: Subscriptions
el: Συνδρομές

source: Add Subscription
el: Προσθήκη Συνδρομής

source: No Subscriptions Found
el: Δεν βρέθηκαν συνδρομές

# noSubscriptionsDescription
source: We'll automatically detect subscriptions from your transactions, or you can add them manually.
el: Θα εντοπίσουμε αυτόματα συνδρομές από τις συναλλαγές σας ή μπορείτε να τις προσθέσετε χειροκίνητα.

source: Add Manually
el: Μη αυτόματη προσθήκη

source: Monthly Spend
el: Μηνιαία Δαπάνη

source: Active
el: Ενεργή

source: Trial
el: Δοκιμαστική

source: Paused
el: Σε παύση

source: Ended
el: Έχει λήξει

source: All
el: Όλες

# noFilteredSubscriptions
source: No {filter} Subscriptions
el: Καμία {filter} συνδρομή

# trySelectingDifferentFilter
source: Try selecting a different filter
el: Δοκιμάστε να επιλέξετε διαφορετικό φίλτρο

source: Show All
el: Εμφάνιση όλων

source: Loading subscriptions...
el: Φόρτωση συνδρομών...

# detailsFor
source: Details for {name}
el: Λεπτομέρειες για {name}

source: Spending Insights
el: Αναλύσεις Δαπανών

# errorLoadingCategories
source: Error loading categories: {error}
el: Σφάλμα φόρτωσης κατηγοριών: {error}

# notEnoughDataForInsights
source: Not enough data for insights yet.
el: Δεν υπάρχουν αρκετά δεδομένα για αναλύσεις ακόμα.

# connectEmailInsights
source: Connect your email to see your spending patterns.
el: Συνδέστε το email σας για να δείτε τα μοτίβα δαπανών σας.

source: Monthly Trend
el: Μηνιαία Τάση

source: Top Merchants
el: Κορυφαίοι Έμποροι

source: Total Volume
el: Συνολικός Όγκος

# avgPerDay
source: Avg. / Day
el: ΜΟ / Ημέρα

source: Other
el: Άλλο

source: Skip
el: Παράλειψη

source: Get Started
el: Ξεκινήστε

# continueText
source: Continue
el: Συνέχεια

# onboardingTitle1
source: Take Control of Your Spending
el: Πάρτε τον έλεγχο των δαπανών σας

# onboardingDesc1
source: PennyPilot helps you navigate your finances with ease and precision.
el: Το PennyPilot σας βοηθά να διαχειρίζεστε τα οικονομικά σας με ευκολία και ακρίβεια.

# onboardingTitle2
source: Privacy is Our Priority
el: Η ιδιωτικότητα είναι προτεραιότητά μας

# onboardingDesc2
source: Your data never leaves your device. Everything is processed locally for maximum security.
el: Τα δεδομένα σας δεν φεύγουν ποτέ από τη συσκευή σας. Όλα υποβάλλονται σε επεξεργασία τοπικά για μέγιστη ασφάλεια.

# onboardingTitle3
source: AI-Powered Insights
el: Αναλύσεις με τη βοήθεια τεχνητής νοημοσύνης

# onboardingDesc3
source: On-device AI automatically identifies transactions and tracks subscriptions from your emails.
el: Η τεχνητή νοημοσύνη στη συσκευή εντοπίζει αυτόματα συναλλαγές και παρακολουθεί συνδρομές από τα email σας.

source: Connect Accounts
el: Σύνδεση Λογαριασμών

# linkEmailDescription
source: Link your email to automatically track expenses.
el: Συνδέστε το email σας για αυτόματη παρακολούθηση εξόδων.

source: Connect Gmail
el: Σύνδεση Gmail

# connectedTo
source: Connected to {account}
el: Συνδέθηκε στο {account}

# failedToConnect
source: Failed to connect: {error}
el: Αποτυχία σύνδεσης: {error}

source: Connect Outlook
el: Σύνδεση Outlook

source: Connect iCloud
el: Σύνδεση iCloud

# tryDemoMode
source: Try Demo Mode (Mock Data)
el: Δοκιμή Demo (Εικονικά Δεδομένα)

# privacyDisclaimer
source: We only read emails related to receipts and subscriptions. No data leaves your device.
el: Διαβάζουμε μόνο email που σχετίζονται με αποδείξεις και συνδρομές. Κανένα δεδομένο δεν φεύγει από τη συσκευή σας.

source: Transaction recorded
el: Η συναλλαγή καταγράφηκε

# error
source: Error: {error}
el: Σφάλμα: {error}

source: New Entry
el: Νέα Εγγραφή

source: Expense
el: Έξοδο

# incomeLabel
source: Income
el: Έσοδο

# pleaseEnterAmount
source: Please enter an amount
el: Παρακαλώ εισάγετε ένα ποσό

source: Invalid amount
el: Μη έγκυρο ποσό

source: Source
el: Πηγή

# merchantLabel
source: Merchant
el: Έμπορος

source: Please enter source
el: Παρακαλώ εισάγετε πηγή

source: Please enter merchant
el: Παρακαλώ εισάγετε έμπορο

source: Category
el: Κατηγορία

# pleaseSelectCategory
source: Please select a category
el: Παρακαλώ επιλέξτε κατηγορία

source: Recurring
el: Επαναλαμβανόμενη

# recurringIncomeDescription
source: Regular income like salary
el: Τακτικό εισόδημα όπως ο μισθός

# recurringExpenseDescription
source: Repeating expense like subscription
el: Επαναλαμβανόμενο έξοδο όπως μια συνδρομή

source: Save Transaction
el: Αποθήκευση Συναλλαγής

# subscriptionAdded
source: Subscription added successfully
el: Η συνδρομή προστέθηκε με επιτυχία

# errorAddingSubscription
source: Error adding subscription: {error}
el: Σφάλμα κατά την προσθήκη συνδρομής: {error}

source: Service Name
el: Όνομα Υπηρεσίας

# serviceNameHint
source: e.g. Netflix, Spotify
el: π.χ. Netflix, Spotify

source: Required
el: Απαιτείται

source: Invalid
el: Μη έγκυρο

source: Billing Cycle
el: Κύκλος Χρέωσης

source: Next Renewal Date
el: Επόμενη Ημερομηνία Ανανέωσης

source: Notes (Optional)
el: Σημειώσεις (Προαιρετικό)

source: Try Again
el: Δοκιμάστε Ξανά
